### Plan for `FILETRAIL/non-prod`
```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

### Plan for `FILETRAIL/prod`
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_entity_tags.synthetic_tags["FILETRAIL_PING_TAG121"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FileTrail",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["FILETRAIL_PING_TAG122"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FileTrail",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["FILETRAIL_PING_TAG123"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FileTrail",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["FILETRAIL_PING_TAG124"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FileTrail",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["FILETRAIL_PING_TAG125"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FileTrail",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FILETRAIL_PING121"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FILETRAIL - PING test for https://norfolkcounty.filetrail.com/logoff.aspx"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://norfolkcounty.filetrail.com/logoff.aspx"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FILETRAIL_PING122"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FILETRAIL - PING test for https://oakgov.filetrail.com/logoff.aspx"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://oakgov.filetrail.com/logoff.aspx"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FILETRAIL_PING123"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FILETRAIL - PING test for https://olympia.filetrail.com/logoff.aspx"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://olympia.filetrail.com/logoff.aspx"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FILETRAIL_PING124"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FILETRAIL - PING test for https://omm.filetrail.com/logoff.aspx"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://omm.filetrail.com/logoff.aspx"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FILETRAIL_PING125"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FILETRAIL - PING test for https://devomm.filetrail.com/logoff.aspx"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://devomm.filetrail.com/logoff.aspx"
      + verify_ssl        = true
    }

Plan: 10 to add, 0 to change, 0 to destroy.

```

### Plan for `FOUNDATION/non-prod`
```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

### Plan for `FOUNDATION/prod`
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_entity_tags.synthetic_tags["FOUNDATION_PING_TAG214"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "staging",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FOUNDATION",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["FOUNDATION_PING_TAG215"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FOUNDATION",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FOUNDATION_PING214"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FOUNDATION - PING test for nortonrosefulbrightstaging.foundation.litera.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://nortonrosefulbrightstaging.foundation.litera.com"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FOUNDATION_PING215"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FOUNDATION - PING test for sheppardmullin.foundation.litera.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "ENABLED"
      + type              = "SIMPLE"
      + uri               = "https://sheppardmullin.foundation.litera.com/"
      + verify_ssl        = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

